In [2]:
import numpy as np
import pandas as pd

In [5]:
string_data = pd.Series(['Rob','Jake',np.nan,'Elon'])
string_data

0     Rob
1    Jake
2     NaN
3    Elon
dtype: object

In [12]:
print(f"Rep. string_data where values are NULL\n{string_data.isnull()}")

Rep. string_data where values are NULL
0       False
1       False
2        True
3       False
Elon     True
dtype: bool

In [10]:
#put elon as Null value
string_data['Elon']= None

print(f'Rep. string_data where values are NOT NULL\n{string_data.notnull()}')

Rep. string_data where values are NOT NULL
0        True
1        True
2       False
3        True
Elon    False
dtype: bool

In [6]:
from numpy import nan as NA #this imports the nan values present in the data as "NA"

data = pd.Series(['Steve',NA,'Kane',114,NA, 'Von Russom', 9.8])
print(f"Data with null values present")
print(data)

print("Data With NULL VALUES DROPPED/ REMOVED")
data.dropna() #.dropna() is used to drop Nan Values

Data with null values present
0         Steve
1           NaN
2          Kane
3           114
4           NaN
5    Von Russom
6           9.8
dtype: object
Data With NULL VALUES DROPPED/ REMOVED

0         Steve
2          Kane
3           114
5    Von Russom
6           9.8
dtype: object

In [7]:
#we have filtered the notnull values in our dataframe using .notnull() func
#now, we'll apply it on our dataframe.
data.notnull()

0     True
1    False
2     True
3     True
4    False
5     True
6     True
dtype: bool

In [8]:
#applying on our dataframe named; data  
data[data.notnull()]

0         Steve
2          Kane
3           114
5    Von Russom
6           9.8
dtype: object

In [29]:
data[-1]=NA
data[-3] = "Minus2"
data

 0         Steve
 1           NaN
 2          Kane
 3           114
 4           NaN
 5    Von Russom
 6           9.8
-1           NaN
-3        Minus2
dtype: object

In [30]:
data.dropna()

 0         Steve
 2          Kane
 3           114
 5    Von Russom
 6           9.8
-3        Minus2
dtype: object

In [33]:
data = pd.DataFrame([[1.6,5,3.2],[NA,2.2,0.88],[1.,NA,NA],[NA,4.7,NA]])
data

     0    1     2
0  1.6  5.0  3.20
1  NaN  2.2  0.88
2  1.0  NaN   NaN
3  NaN  4.7   NaN

In [44]:
op1 = data.fillna(data.mean())
op1

     0         1     2
0  1.6  5.000000  3.20
1  1.3  2.200000  0.88
2  1.0  3.966667  2.04
3  1.3  4.700000  2.04

In [54]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[:2,1] = NA
df.iloc[3:5,2] = NA
df

          0         1         2
0 -0.615447       NaN -1.315850
1  0.511916       NaN -1.193316
2 -0.340828 -0.870676  0.023904
3 -0.892447 -0.812911       NaN
4  1.425863  0.280989       NaN
5 -0.303726  0.591428  0.764997

In [56]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.615447       NaN -1.315850
1  0.511916       NaN -1.193316
2 -0.340828 -0.870676  0.023904
3 -0.892447 -0.812911  0.023904
4  1.425863  0.280989  0.023904
5 -0.303726  0.591428  0.764997

## `.replace()` Replacing Missing Values

In [63]:
data = pd.Series([-1,99,55, 22, 55, 45, 55])
data

0    -1
1    99
2    55
3    22
4    55
5    45
6    55
dtype: int64

In [66]:
data.replace([55,-1],np.nan)
data

0    -1
1    99
2    55
3    22
4    55
5    45
6    55
dtype: int64

In [67]:
data.replace({2:0.44,3:.45,4:.478,5:.884,6:.432})
data

0    -1
1    99
2    55
3    22
4    55
5    45
6    55
dtype: int64

In [73]:
df = pd.DataFrame(np.arange(12).reshape(3,4),
                 index = ["Nagpur","Pune","Mumbai"],
                 columns = ["one",'two','three','four'])
df

        one  two  three  four
Nagpur    0    1      2     3
Pune      4    5      6     7
Mumbai    8    9     10    11

In [77]:
data = df.rename(index= str.lower, columns = str.upper)
data

        ONE  TWO  THREE  FOUR
nagpur    0    1      2     3
pune      4    5      6     7
mumbai    8    9     10    11